tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-versions"

# Essential tools
brew "zsh"
brew "tmux"
brew "vim"
brew "git"
cask "docker"
cask "visual-studio-code"

# More tools
brew "ghq"
brew "peco"
brew "jq"
brew "pwgen"
brew "direnv"
brew "awscli"
cask "google-cloud-sdk"

# Languages
brew "python"
cask "java11"
brew "maven"
brew "sbt"
brew "go"
brew "dep"

# Fonts
cask "font-source-code-pro"
